
## Plan Result (terraform/env)

[CI link](https://github.com/team-all-in/all-in/actions/runs/10859445972)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ecr_lifecycle_policy.all_in_api
  * aws_ecr_repository.all_in_api


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecr_lifecycle_policy.all_in_api will be created
  + resource "aws_ecr_lifecycle_policy" "all_in_api" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "all_in_api"
    }

  # aws_ecr_repository.all_in_api will be created
  + resource "aws_ecr_repository" "all_in_api" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "all_in_api"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":46,"Program":"tfcmt","SHA1":"ad4aabdfe0dc011eca109ba88e743f6bb0ac7194","Target":"terraform/env","Vars":{},"WorkflowName":"pull_request_target"} -->